Revit 2027 API
RebarShapeConstraintProjectedSegmentLength.GetSegmentEndReferenceType Method
 Choice of two possibilities for the start and end references of the length constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeSegmentEndReferenceType GetSegmentEndReferenceType(
	int index
)
Public Function GetSegmentEndReferenceType (
	index As Integer
) As RebarShapeSegmentEndReferenceType
public:
RebarShapeSegmentEndReferenceType GetSegmentEndReferenceType(
	int index
)
member GetSegmentEndReferenceType :
        index : int -> RebarShapeSegmentEndReferenceType
Parameters
index Int32
 Which reference on the constraint. Either 0 or 1.
Return Value
RebarShapeSegmentEndReferenceType
Exceptions
Exception | Condition
ArgumentException |  index is not 0 or 1.
See Also
Reference
RebarShapeConstraintProjectedSegmentLength Class
Autodesk.Revit.DB.Structure Namespace